AccumulationRegisters/БонусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>БонусыКонтрагентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументНАНБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НастройкаАвтоматическихНачисленийБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/НастройкиНачисленияБонусовПоПродажам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиНачисленияБонусовПоПродажам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БонусСуммой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БонусПроцентом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеНачислятьБонусы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовНачисленияБонусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыБонусныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыБонусныхСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UDS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НастройкаАвтоматическихНачисленийБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НастройкаАвтоматическихНачисленийБонусов</Name>
			<Comment>#13834</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовНачисленияБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкаПоВидамНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеНачислятьБонусы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусСуммой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусПроцентом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаПоНоменклатуре</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеНачислятьБонусы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусСуммой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусПроцентом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаИКассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетКасса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонусПроцентом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/БонусыСервер/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура НастройкаЭлементов(Элементы, ДокОбъект) Экспорт
	
	//#13359
	Элементы.СлужебныйВидБонуснойСистемы.ТолькоПросмотр = НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешеноМенятьВидБонуснойСистемыВДокументе");
	
	Если ДокОбъект.СлужебныйВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.Внутренняя тогда
		
		Элементы.ГруппаВидБонуснойСистемыUDS.Видимость = Ложь;
		Элементы.ГруппаВидБонуснойСистемыВнутренняя.Видимость = Истина;
		
		Элементы.ГруппаВидыБонусныхСистем.ТекущаяСтраница = Элементы.ГруппаВидБонуснойСистемыВнутренняя;
		
	ИначеЕсли ДокОбъект.СлужебныйВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.UDS тогда
		
		Элементы.ГруппаВидБонуснойСистемыВнутренняя.Видимость = Ложь;
		Элементы.ГруппаВидБонуснойСистемыUDS.Видимость = Истина;
		
		Элементы.ГруппаВидыБонусныхСистем.ТекущаяСтраница = Элементы.ГруппаВидБонуснойСистемыUDS;
		Если ЗначениеЗаполнено(ДокОбъект.UDS_ИдентификаторОперации) Тогда
			Элементы.ГруппаВидыБонусныхСистем.ТолькоПросмотр = Истина;	
		КонецЕсли;
		
		Элементы.ДоступноБонусовКСписаниюUDS.Видимость = ДокОбъект.СписыватьБонусы;
		Элементы.СуммаБонусовКСписаниюUDS.Видимость = ДокОбъект.СписыватьБонусы;
		
	КонецЕсли;
	
КонецПроцедуры

// №13299
Процедура ОпределитьОстатокПоДисконтнойКарте(Форма) Экспорт
	
	ДанныеФормыОбъект = Форма.Объект;
	
	Если НЕ ДанныеФормыОбъект.СлужебныйВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.Внутренняя Тогда
		Возврат;
	КонецЕсли;	
	
	ДатаЗапроса = ДанныеФормыОбъект.Дата;
	Если ДатаЗапроса = Дата(1,1,1) Тогда
		ДатаЗапроса = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Форма.ОстатокПоДисконтнойКарте = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА &УчетБонусовПоДисконтнымКартам И (&ДисконтнаяКарта = Значение(Справочник.ДисконтныеКарты.ПустаяСсылка))
	|			ТОГДА 0
	|		ИНАЧЕ БонусыКонтрагентовОстатки.СуммаОстаток
	|	КОНЕЦ КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.БонусыКонтрагентов.Остатки(
	|			&ДатаЗапроса,
	|			Контрагент = &Контрагент
	|				И ДисконтнаяКарта = &ДисконтнаяКарта) КАК БонусыКонтрагентовОстатки";
	
	//#15828 на момент документа
	//Запрос.УстановитьПараметр("ДатаЗапроса", КонецДня(ДатаЗапроса));
	Запрос.УстановитьПараметр("ДатаЗапроса", Новый Граница(ДатаЗапроса, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДисконтнаяКарта", ДанныеФормыОбъект.ДисконтнаяКарта);
	Запрос.УстановитьПараметр("Контрагент", ДанныеФормыОбъект.Контрагент);
	Запрос.УстановитьПараметр("УчетБонусовПоДисконтнымКартам", ДанныеФормыОбъект.СлужебныйУчетБонусовПоДисконтнымКартам); // №6316 нужно проверить заполненность дисконтной карты
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Форма.ОстатокПоДисконтнойКарте = Выборка.СуммаОстаток;
	КонецЦикла;
	
КонецПроцедуры

// №13299
Процедура ПересчитатьБонусыПоДокументу(ДанныеФормыОбъект, ЕстьУслуги = Ложь, КатегорияИзДокумента = Истина) Экспорт
	
	//ДанныеФормыОбъект = Форма.Объект;
	//ЕстьУслуги = ДанныеФормыОбъект.Свойство("Услуги");
	
	Если НЕ ДанныеФормыОбъект.СлужебныйВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.Внутренняя Тогда
		Возврат;
	КонецЕсли;
		
	ДокументНАНБ = Документы.НастройкаАвтоматическихНачисленийБонусов.ПустаяСсылка();
	
	Если ДанныеФормыОбъект.СлужебныйУчитыватьБонусы Тогда
		
		мНачислятьБонусы = ДанныеФормыОбъект.НачислятьБонусы;
		Если мНачислятьБонусы И (ДанныеФормыОбъект.Товары.Итог("СкидкаБонусами") + ?(ЕстьУслуги, ДанныеФормыОбъект.Услуги.Итог("СкидкаБонусами"), 0)) > 0 Тогда
			Если НЕ ДанныеФормыОбъект.НачислятьБонусыПоДисконтнойКартеПриЗачетеБонусовКакСкидку Тогда
				мНачислятьБонусы = Ложь;
			КонецЕсли;
		КонецЕсли;
				
		Если мНачислятьБонусы Тогда
			
			// рассчитаем бонусы к начислению
			ДатаРасчета = ?(ДанныеФормыОбъект.Дата = Дата(1,1,1), ТекущаяДатаСеанса(), ДанныеФормыОбъект.Дата);
			ВидДокументаНБ = ВидДокументаНачисленияБонусовПоСсылке(ДанныеФормыОбъект.Ссылка);
			КатегорияКонтрагента = ?(КатегорияИзДокумента, ДанныеФормыОбъект.КатегорияКонтрагента, ДанныеФормыОбъект.Контрагент.Категория);
			ПараметрыОтбора = Новый Структура("Организация, ВидДокумента, КатегорияКонтрагента", 
												ДанныеФормыОбъект.Организация, ВидДокументаНБ, КатегорияКонтрагента);
			ДокументНАНБ = ПодобратьДокументНастройкиНачисленияБонусов(ДатаРасчета, ПараметрыОтбора);
	
			ТаблицаБонусовТовары = ПолучитьТаблицуБонусовКНачислению(ДокументНАНБ, ДатаРасчета, ДанныеФормыОбъект.Товары.Выгрузить()); //, ДанныеФормыОбъект.Дата, ДанныеФормыОбъект.Организация, ДанныеФормыОбъект.Контрагент.Категория, ДанныеФормыОбъект.Ссылка);
			
			Если ЕстьУслуги Тогда
				ТаблицаБонусовУслуги = ПолучитьТаблицуБонусовКНачислению(ДокументНАНБ, ДатаРасчета, ДанныеФормыОбъект.Услуги.Выгрузить()); //, ДанныеФормыОбъект.Дата, ДанныеФормыОбъект.Организация, ДанныеФормыОбъект.Контрагент.Категория, ДанныеФормыОбъект.Ссылка);
			КонецЕсли;
			
			Для Каждого ТекущаяСтрока Из ДанныеФормыОбъект.Товары Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
				
				НайденныеСтроки = ТаблицаБонусовТовары.НайтиСтроки(Отбор);
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					//вычисляем сумму бонусов для строки, а не просто присваиваем, т.к. в документе номенклатура в строках может быть задвоена
					Если НайденныеСтроки[0].КоличествоПродажи <> 0 Тогда
						ТекущаяСтрока.БонусыКНачислению = (НайденныеСтроки[0].БонусыКНачислению / НайденныеСтроки[0].КоличествоПродажи) * (ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЕстьУслуги Тогда
				
				Для Каждого ТекущаяСтрока Из ДанныеФормыОбъект.Услуги Цикл
					
					Отбор = Новый Структура;
					Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
					
					НайденныеСтроки = ТаблицаБонусовУслуги.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						//вычисляем сумму бонусов для строки, а не просто присваиваем, т.к. в документе номенклатура в строках может быть задвоена
						Если НайденныеСтроки[0].КоличествоПродажи <> 0 Тогда
							ТекущаяСтрока.БонусыКНачислению = (НайденныеСтроки[0].БонусыКНачислению / НайденныеСтроки[0].КоличествоПродажи) * (ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент);
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			Для Каждого ТекущаяСтрока Из ДанныеФормыОбъект.Товары Цикл
				ТекущаяСтрока.БонусыКНачислению = 0;
			КонецЦикла;
			
			Если ЕстьУслуги Тогда
				
				Для Каждого ТекущаяСтрока Из ДанныеФормыОбъект.Услуги Цикл
					ТекущаяСтрока.БонусыКНачислению = 0;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СуммаБонусовВрем = ДанныеФормыОбъект.Товары.Итог("БонусыКНачислению") + ?(ЕстьУслуги, ДанныеФормыОбъект.Услуги.Итог("БонусыКНачислению"), 0);
	
	// №6316 нужно проверить заполнение дисконтной карты
	Если ДанныеФормыОбъект.СлужебныйУчетБонусовПоДисконтнымКартам И ДанныеФормыОбъект.ДисконтнаяКарта.Пустая() Тогда
		СуммаБонусовВрем = 0;
	КонецЕсли;	
	
	Если НЕ ДанныеФормыОбъект.СуммаБонусовКНачислениюПоДисконтнойКарте = СуммаБонусовВрем Тогда
		ДанныеФормыОбъект.СуммаБонусовКНачислениюПоДисконтнойКарте = СуммаБонусовВрем;
	КонецЕсли;
	
	Если мНачислятьБонусы = Истина Тогда
		ДанныеФормыОбъект.ДокументНАНБ = ДокументНАНБ;
	КонецЕсли;
	
КонецПроцедуры

// №13299
Процедура ОчиститьСуммуБонусовПоСтрокамДокумента(ДанныеФормыОбъект) Экспорт
	
	//ДанныеФормыОбъект = Форма.Объект;
	//или ДокументОбъект
	
	//ЕстьУслуги = ДанныеФормыОбъект.Свойство("Услуги");
	ЕстьУслуги = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеФормыОбъект, "Услуги");
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(ДанныеФормыОбъект.Организация);
	
	// #10832 Сумму не пересчитываем как Цена*Количество, а берем имеющееся значение
	Для Каждого ТекСтрока Из ДанныеФормыОбъект.Товары Цикл
		
		ТекСтрока.Сумма = ТекСтрока.Сумма + ТекСтрока.СкидкаБонусами;
		ТекСтрока.СкидкаБонусами = 0;
		
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекСтрока, УчитыватьНДС);
		
	КонецЦикла;
	
	Если ЕстьУслуги Тогда
			
		Для Каждого ТекСтрока Из ДанныеФормыОбъект.Услуги Цикл
			
			ТекСтрока.Сумма = ТекСтрока.Сумма + ТекСтрока.СкидкаБонусами;
			ТекСтрока.СкидкаБонусами = 0;
			
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекСтрока, УчитыватьНДС);
			
		КонецЦикла;
		
	КонецЕсли;
	
	//#8095
	ДанныеФормыОбъект.СуммаДокумента = ДанныеФормыОбъект.Товары.Итог("Сумма") + ?(ЕстьУслуги, ДанныеФормыОбъект.Услуги.Итог("Сумма"), 0); 

КонецПроцедуры

// №13299
Процедура РаспределитьСкидкуБонусамиПоСтрокамДокумента(ДанныеФормыОбъект, ПолеСуммаСкидки = Неопределено, СуммаРаспределения = Неопределено) Экспорт
	
	//ДанныеФормыОбъект = Форма.Объект;
	//или ДокументОбъект
	
	Если ПолеСуммаСкидки = Неопределено Тогда
		ПолеСуммаСкидки = "СкидкаБонусами";
	КонецЕсли;
	
	Если СуммаРаспределения = Неопределено Тогда
		СуммаРаспределения = ДанныеФормыОбъект.СуммаБонусовКСписаниюПоДисконтнойКарте;
	КонецЕсли;
	
	//ЕстьУслуги = ДанныеФормыОбъект.Свойство("Услуги");
	ЕстьУслуги = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеФормыОбъект, "Услуги");
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(ДанныеФормыОбъект.Организация);
	
	ОчиститьСуммуБонусовПоСтрокамДокумента(ДанныеФормыОбъект); //ОчиститьСуммуБонусовПоДисконтнымКартамПоСтрокам(ДанныеФормыОбъект);
	
	РаспределитьВсего = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ДанныеФормыОбъект.Валюта, ДанныеФормыОбъект.Дата, СуммаРаспределения);
	РаспределитьНаУслуги = 0;
	РаспределитьНаТовары = 0;
	
	ИтоговаяСумммаДокументаДолжнаБыть = ДанныеФормыОбъект.СуммаДокумента - РаспределитьВсего;
	
	//#8095 вычисляем сумму только по "платным" строкам
	//СуммаТовары = Товары.Итог("Сумма");
	//СуммаУслуги = Услуги.Итог("Сумма");
	СуммаТовары = 0;
	СуммаУслуги = 0;
	
	Для Каждого ТекСтрока Из ДанныеФормыОбъект.Товары Цикл
		Если НЕ ТекСтрока.Сумма = 0 И НЕ ТекСтрока.Бесплатно Тогда
			СуммаТовары = СуммаТовары + ТекСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьУслуги Тогда
		
		Для Каждого ТекСтрока Из ДанныеФормыОбъект.Услуги Цикл
			Если НЕ ТекСтрока.Сумма = 0 И НЕ ТекСтрока.Бесплатно Тогда
				СуммаУслуги = СуммаУслуги + ТекСтрока.Сумма;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
													   
	Если СуммаТовары + СуммаУслуги = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РаспределитьНаУслуги = Окр(СуммаУслуги / (СуммаТовары + СуммаУслуги) * РаспределитьВсего, 2);
	РаспределитьНаТовары = РаспределитьВсего - РаспределитьНаУслуги;

	// распределим сумму бонусов как скидку
	Если НЕ СуммаУслуги = 0 Тогда
		
		Для Каждого ТекСтрока Из ДанныеФормыОбъект.Услуги Цикл
			
			Если ТекСтрока.Сумма = 0 ИЛИ ТекСтрока.Бесплатно Тогда
				// #8095 пропускаем "бесплатные" строки
				Продолжить;
			КонецЕсли;
			
			ТекСтрока[ПолеСуммаСкидки] = Окр((ТекСтрока.Сумма / СуммаУслуги) * РаспределитьНаУслуги,2);
			// #10832 Сумму не пересчитываем как Цена*Количество, а берем имеющееся значение
			//ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена - ТекСтрока.СуммаРучнойСкидки - ТекСтрока.СкидкаБонусами;
			ТекСтрока.Сумма = ТекСтрока.Сумма - ТекСтрока[ПолеСуммаСкидки];
			
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекСтрока, УчитыватьНДС);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ СуммаТовары = 0 Тогда
		
		Для Каждого ТекСтрока Из ДанныеФормыОбъект.Товары Цикл
			
			Если ТекСтрока.Сумма = 0 ИЛИ ТекСтрока.Бесплатно Тогда
				// #8095 пропускаем "бесплатные" строки
				Продолжить;
			КонецЕсли;
			
			ТекСтрока[ПолеСуммаСкидки] = Окр((ТекСтрока.Сумма / СуммаТовары) * РаспределитьНаТовары,2);
			//ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена - ТекСтрока.СуммаРучнойСкидки - ТекСтрока.СкидкаБонусами;
			ТекСтрока.Сумма = ТекСтрока.Сумма - ТекСтрока[ПолеСуммаСкидки];
			
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекСтрока, УчитыватьНДС);
			
		КонецЦикла;
		
	КонецЕсли;
	
	РазницаВРаспределении = (ДанныеФормыОбъект.Товары.Итог("Сумма") + ?(ЕстьУслуги, ДанныеФормыОбъект.Услуги.Итог("Сумма"), 0)) - ИтоговаяСумммаДокументаДолжнаБыть;
	
	Если НЕ РазницаВРаспределении = 0 Тогда
		
		// скорее всего копейка "закатилась" при округлениях, добавим ее
		Если ЕстьУслуги И ДанныеФормыОбъект.Услуги.Количество() > 0 Тогда
			
			Для Каждого ТекСтрока Из ДанныеФормыОбъект.Услуги Цикл
				
				Если ТекСтрока.Сумма = 0 ИЛИ ТекСтрока.Бесплатно Тогда
					// #8095 пропускаем "бесплатные" строки
					Продолжить;
				Иначе
					
					КРаспределению = Мин(ТекСтрока.Сумма, РазницаВРаспределении);
					ТекСтрока[ПолеСуммаСкидки] = ТекСтрока[ПолеСуммаСкидки] + КРаспределению;
					//ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена - ТекСтрока.СуммаРучнойСкидки - ТекСтрока.СкидкаБонусами;
					// #11036 исправлено: вычитаем не всю сумму бонусов, а только остаток к Распределению
					ТекСтрока.Сумма = ТекСтрока.Сумма - КРаспределению; // - ТекСтрока.СкидкаБонусами;
					
					ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекСтрока, УчитыватьНДС);
					
					РазницаВРаспределении = РазницаВРаспределении - КРаспределению;
					Если РазницаВРаспределении = 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ РазницаВРаспределении = 0 И ДанныеФормыОбъект.Товары.Количество() > 0 Тогда
			
			Для Каждого ТекСтрока Из ДанныеФормыОбъект.Товары Цикл
				
				Если ТекСтрока.Сумма = 0 ИЛИ ТекСтрока.Бесплатно Тогда
					// #8095 пропускаем "бесплатные" строки
					Продолжить;
				Иначе
					
					КРаспределению = Мин(ТекСтрока.Сумма, РазницаВРаспределении);
					ТекСтрока[ПолеСуммаСкидки] = ТекСтрока[ПолеСуммаСкидки] + КРаспределению;
					//ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена - ТекСтрока.СуммаРучнойСкидки - ТекСтрока.СкидкаБонусами;
					// #11036 исправлено: вычитаем не всю сумму бонусов, а только остаток к Распределению
					ТекСтрока.Сумма = ТекСтрока.Сумма - КРаспределению; // - ТекСтрока.СкидкаБонусами;
					
					ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекСтрока, УчитыватьНДС);
					
					РазницаВРаспределении = РазницаВРаспределении - КРаспределению;
					Если РазницаВРаспределении = 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//ПересчитатьБонусыПоДокументу(ДанныеФормыОбъект);
		
КонецПроцедуры

Функция ВидДокументаНачисленияБонусовПоСсылке(ДокументСсылка)
	
	ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.ПустаяСсылка();
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.РеализацияТоваровИУслуг;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Монтаж") Тогда
		//для розницы дисконтные карты пока неработают
		//ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.Монтаж;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.ПриходныйКассовыйОрдер;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.ПоступлениеНаРасчетныйСчет;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОплатаБанковскойКартой") Тогда
		ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.ОплатаБанковскойКартой;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.РасходныйКассовыйОрдер;
	КонецЕсли;
	
	Возврат ВидДокумента;
	
КонецФункции

Функция ПолучитьТаблицуБонусовКНачислению(ДокументНАНБ, ДатаРасчета, Знач ТаблицаДокумента)
	
	//++ #13834
	//ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.ПустаяСсылка();
	//Если ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
	//	ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.РеализацияТоваровИУслуг;	
	//КонецЕсли;
	//ВидДокумента = ВидДокументаНачисленияБонусовПоСсылке(ДокументПродажи);
	//-- #13834
	
	//++ #13834	
	//Если Дата = Дата(1,1,1) Тогда
	//	Дата = КонецДня(ТекущаяДатаСеанса());
	//Иначе
	//	Дата = КонецДня(Дата);
	//КонецЕсли;
	//ДатаРасчета = ?(Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Дата);
	//-- #13834
	
	//ПараметрыОтбора = Новый Структура("Организация, ВидДокумента, КатегорияКонтрагента", Организация, ВидДокумента, КатегорияКонтрагента);
	//ДокументНАНБ = ПодобратьДокументНастройкиНачисленияБонусов(ДатаРасчета, ПараметрыОтбора);
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	//ТаблицаРезультата.Колонки.Добавить("Организация", 			Новый ОписаниеТипов("СправочникСсылка.Организации"));
	//ТаблицаРезультата.Колонки.Добавить("КатегорияКонтрагента", 	Новый ОписаниеТипов("СправочникСсылка.КатегорииКонтрагентов"));
	ТаблицаРезультата.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаРезультата.Колонки.Добавить("ВидНоменклатуры",		Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	ТаблицаРезультата.Колонки.Добавить("Категория", 			Новый ОписаниеТипов("СправочникСсылка.КатегорияНоменклатуры"));
	//ТаблицаРезультата.Колонки.Добавить("ВидДокумента", 			Новый ОписаниеТипов("СправочникСсылка.ВидыДокументовНачисленияБонусов"));
	ТаблицаРезультата.Колонки.Добавить("НеНачислятьБонусы",  	Новый ОписаниеТипов("Булево"));
	ТаблицаРезультата.Колонки.Добавить("БонусСуммой", 			Новый ОписаниеТипов("Число"));
	ТаблицаРезультата.Колонки.Добавить("БонусПроцентом", 		Новый ОписаниеТипов("Число"));
	ТаблицаРезультата.Колонки.Добавить("СуммаПродажи", 			Новый ОписаниеТипов("Число"));
	ТаблицаРезультата.Колонки.Добавить("КоличествоПродажи", 	Новый ОписаниеТипов("Число"));
	
	Для Каждого ТекущаяСтрока Из ТаблицаДокумента Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаРезультата.Добавить();
		//НоваяСтрока.Организация 			= Организация;
		//НоваяСтрока.КатегорияКонтрагента 	= КатегорияКонтрагента;
		НоваяСтрока.Номенклатура 			= ТекущаяСтрока.Номенклатура;
		ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСтрока.Номенклатура, "ВидНоменклатуры, Категория");
		НоваяСтрока.ВидНоменклатуры 		= ДанныеНоменклатуры.ВидНоменклатуры;
		НоваяСтрока.Категория 				= ДанныеНоменклатуры.Категория;
		//НоваяСтрока.ВидДокумента 			= ВидДокумента;
		НоваяСтрока.СуммаПродажи 			= ТекущаяСтрока.Сумма;
		НоваяСтрока.КоличествоПродажи 		= ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
	КонецЦикла;
	//ТаблицаРезультата.Свернуть("Организация, КатегорияКонтрагента, Номенклатура, ВидНоменклатуры, Категория, ВидДокумента, НеНачислятьБонусы, БонусСуммой, БонусПроцентом","СуммаПродажи, КоличествоПродажи");
	ТаблицаРезультата.Свернуть("Номенклатура, ВидНоменклатуры, Категория, НеНачислятьБонусы, БонусСуммой, БонусПроцентом","СуммаПродажи, КоличествоПродажи");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРезультата", ТаблицаРезультата);
	Запрос.УстановитьПараметр("ДокументНАНБ", ДокументНАНБ);
	//Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТаблицаРезультата.Организация,
	//|	ТаблицаРезультата.КатегорияКонтрагента,
	|	ТаблицаРезультата.Номенклатура,
	|	ТаблицаРезультата.ВидНоменклатуры,
	|	ТаблицаРезультата.Категория
	//|	ТаблицаРезультата.ВидДокумента
	|ПОМЕСТИТЬ ТаблицаРезультата
	|ИЗ
	|	&ТаблицаРезультата КАК ТаблицаРезультата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТаблицаРезультата.Организация,
	//|	ТаблицаРезультата.КатегорияКонтрагента,
	|	ТаблицаРезультата.Номенклатура,
	|	ТаблицаРезультата.ВидНоменклатуры,
	|	ТаблицаРезультата.Категория,
	//|	ТаблицаРезультата.ВидДокумента,
	|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.БонусСуммой,
	|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.БонусПроцентом,
	|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.НеНачислятьБонусы
	|ИЗ
	|	ТаблицаРезультата КАК ТаблицаРезультата
	// #13834 регистр не используется
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНачисленияБонусовПоПродажам.СрезПоследних(&Дата, ) КАК НастройкиНачисленияБонусовПоПродажамСрезПоследних
	//|		ПО ТаблицаРезультата.Организация = НастройкиНачисленияБонусовПоПродажамСрезПоследних.Организация
	//|			И ТаблицаРезультата.КатегорияКонтрагента = НастройкиНачисленияБонусовПоПродажамСрезПоследних.КатегорияКонтрагента
	//|			И ТаблицаРезультата.ВидДокумента = НастройкиНачисленияБонусовПоПродажамСрезПоследних.ВидДокумента
	//|			И ТаблицаРезультата.ВидНоменклатуры = НастройкиНачисленияБонусовПоПродажамСрезПоследних.ВидНоменклатуры
	//|ГДЕ
	//|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.Категория.Ссылка ЕСТЬ NULL
	//|	И НастройкиНачисленияБонусовПоПродажамСрезПоследних.Номенклатура.Ссылка ЕСТЬ NULL
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НастройкаАвтоматическихНачисленийБонусов.НастройкаПоВидамНоменклатуры КАК НастройкиНачисленияБонусовПоПродажамСрезПоследних
	|		ПО НастройкиНачисленияБонусовПоПродажамСрезПоследних.Ссылка = &ДокументНАНБ
	|			И ТаблицаРезультата.ВидНоменклатуры = НастройкиНачисленияБонусовПоПродажамСрезПоследних.ВидНоменклатуры
	|			И НастройкиНачисленияБонусовПоПродажамСрезПоследних.Категория.Ссылка ЕСТЬ NULL
	//|ГДЕ
	//|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.Категория.Ссылка ЕСТЬ NULL
	//|	И НастройкиНачисленияБонусовПоПродажамСрезПоследних.Номенклатура.Ссылка ЕСТЬ NULL

	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТаблицаРезультата.Организация,
	//|	ТаблицаРезультата.КатегорияКонтрагента,
	|	ТаблицаРезультата.Номенклатура,
	|	ТаблицаРезультата.ВидНоменклатуры,
	|	ТаблицаРезультата.Категория,
	//|	ТаблицаРезультата.ВидДокумента,
	|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.БонусСуммой,
	|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.БонусПроцентом,
	|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.НеНачислятьБонусы
	|ИЗ
	|	ТаблицаРезультата КАК ТаблицаРезультата
	// #13834 регистр не используется
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНачисленияБонусовПоПродажам.СрезПоследних(&Дата, ) КАК НастройкиНачисленияБонусовПоПродажамСрезПоследних
	//|		ПО ТаблицаРезультата.Организация = НастройкиНачисленияБонусовПоПродажамСрезПоследних.Организация
	//|			И ТаблицаРезультата.КатегорияКонтрагента = НастройкиНачисленияБонусовПоПродажамСрезПоследних.КатегорияКонтрагента
	//|			И ТаблицаРезультата.ВидДокумента = НастройкиНачисленияБонусовПоПродажамСрезПоследних.ВидДокумента
	//|			И ТаблицаРезультата.ВидНоменклатуры = НастройкиНачисленияБонусовПоПродажамСрезПоследних.ВидНоменклатуры
	//|			И ТаблицаРезультата.Категория = НастройкиНачисленияБонусовПоПродажамСрезПоследних.Категория
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НастройкаАвтоматическихНачисленийБонусов.НастройкаПоВидамНоменклатуры КАК НастройкиНачисленияБонусовПоПродажамСрезПоследних
	|		ПО НастройкиНачисленияБонусовПоПродажамСрезПоследних.Ссылка = &ДокументНАНБ
	|			И ТаблицаРезультата.ВидНоменклатуры = НастройкиНачисленияБонусовПоПродажамСрезПоследних.ВидНоменклатуры
	|			И ТаблицаРезультата.Категория = НастройкиНачисленияБонусовПоПродажамСрезПоследних.Категория
	//|ГДЕ
	//|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.Номенклатура.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТаблицаРезультата.Организация,
	//|	ТаблицаРезультата.КатегорияКонтрагента,
	|	ТаблицаРезультата.Номенклатура,
	|	ТаблицаРезультата.ВидНоменклатуры,
	|	ТаблицаРезультата.Категория,
	//|	ТаблицаРезультата.ВидДокумента,
	|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.БонусСуммой,
	|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.БонусПроцентом,
	|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.НеНачислятьБонусы
	|ИЗ
	|	ТаблицаРезультата КАК ТаблицаРезультата
	// #13834 регистр не используется
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиНачисленияБонусовПоПродажам.СрезПоследних(&Дата, ) КАК НастройкиНачисленияБонусовПоПродажамСрезПоследних
	//|		ПО ТаблицаРезультата.Организация = НастройкиНачисленияБонусовПоПродажамСрезПоследних.Организация
	//|			И ТаблицаРезультата.КатегорияКонтрагента = НастройкиНачисленияБонусовПоПродажамСрезПоследних.КатегорияКонтрагента
	//|			И ТаблицаРезультата.ВидДокумента = НастройкиНачисленияБонусовПоПродажамСрезПоследних.ВидДокумента
	//|			И ТаблицаРезультата.Номенклатура = НастройкиНачисленияБонусовПоПродажамСрезПоследних.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НастройкаАвтоматическихНачисленийБонусов.НастройкаПоНоменклатуре КАК НастройкиНачисленияБонусовПоПродажамСрезПоследних
	|		ПО НастройкиНачисленияБонусовПоПродажамСрезПоследних.Ссылка = &ДокументНАНБ
	|			И ТаблицаРезультата.Номенклатура = НастройкиНачисленияБонусовПоПродажамСрезПоследних.Номенклатура
	|";
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	//получаем значения по виду номенклатуры
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		//Отбор = Новый Структура("Организация, КатегорияКонтрагента, Номенклатура, ВидНоменклатуры, Категория, ВидДокумента");
		Отбор = Новый Структура("Номенклатура, ВидНоменклатуры, Категория");
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		
		НайденныеСтроки = ТаблицаРезультата.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].НеНачислятьБонусы = Выборка.НеНачислятьБонусы;
			НайденныеСтроки[0].БонусСуммой = Выборка.БонусСуммой;
			НайденныеСтроки[0].БонусПроцентом = Выборка.БонусПроцентом;
		КонецЕсли;
	КонецЦикла;
		
	//получаем значения по категории номенклатуры - у нее приоритет выше	
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		//Отбор = Новый Структура("Организация, КатегорияКонтрагента, Номенклатура, ВидНоменклатуры, Категория, ВидДокумента");
		Отбор = Новый Структура("Номенклатура, ВидНоменклатуры, Категория");
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);

		НайденныеСтроки = ТаблицаРезультата.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].НеНачислятьБонусы = Выборка.НеНачислятьБонусы;
			НайденныеСтроки[0].БонусСуммой = Выборка.БонусСуммой;
			НайденныеСтроки[0].БонусПроцентом = Выборка.БонусПроцентом;
		КонецЕсли;
	КонецЦикла;
	
	//получаем значения по самой номенклатуре - у нее приоритет выше	
	Выборка = РезультатЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		//Отбор = Новый Структура("Организация, КатегорияКонтрагента, Номенклатура, ВидНоменклатуры, Категория, ВидДокумента");
		Отбор = Новый Структура("Номенклатура, ВидНоменклатуры, Категория");
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);

		НайденныеСтроки = ТаблицаРезультата.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].НеНачислятьБонусы = Выборка.НеНачислятьБонусы;
			НайденныеСтроки[0].БонусСуммой = Выборка.БонусСуммой;
			НайденныеСтроки[0].БонусПроцентом = Выборка.БонусПроцентом;
		КонецЕсли;
	КонецЦикла;
	
	//рассчитаем бонусы
	ТаблицаРезультата.Колонки.Добавить("БонусыКНачислению", Новый ОписаниеТипов("Число"));
	Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
		Если ТекущаяСтрока.НеНачислятьБонусы Тогда
			ТекущаяСтрока.БонусыКНачислению = 0;
		ИначеЕсли ТекущаяСтрока.БонусСуммой > 0 Тогда
			ТекущаяСтрока.БонусыКНачислению = ТекущаяСтрока.БонусСуммой * ТекущаяСтрока.КоличествоПродажи;
		ИначеЕсли ТекущаяСтрока.БонусПроцентом > 0 Тогда
			ТекущаяСтрока.БонусыКНачислению = Окр(ТекущаяСтрока.БонусПроцентом / 100 * ТекущаяСтрока.СуммаПродажи,2);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

//Бонусы по документам оплаты
Функция ПолучитьСуммуБонусовКНачислениюПоДокументуОплаты(Знач Дата, Знач Организация, Знач КатегорияКонтрагента, 
														Знач СчетКасса, Знач СуммаДокумента, 
														Знач ДокументСсылка, Знач ДисконтнаяКарта, 
														Знач УчетБонусовПоДисконтнымКартам) Экспорт
	
	БонусыКВозврату = 0;
	СтруктураВозврата = Новый Структура("ДокументНАНБ, СуммаБонусов", Документы.НастройкаАвтоматическихНачисленийБонусов.ПустаяСсылка(), БонусыКВозврату);
	
	Если СуммаДокумента = 0 Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	// №6316 нужно проверить заполнение дисконтной карты
	Если УчетБонусовПоДисконтнымКартам И ДисконтнаяКарта.Пустая() Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ВидДокумента = ВидДокументаНачисленияБонусовПоСсылке(ДокументСсылка);
	
	ДатаРасчета = ?(Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Дата);
	//Если Дата = Дата(1,1,1) Тогда
	//	Дата = КонецДня(ТекущаяДатаСеанса());
	//Иначе
	//	Дата = КонецДня(Дата);
	//КонецЕсли;
	
	//++ #13834 регистр не используется
	//Запрос = Новый Запрос;
	//Запрос.Текст =	
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.Организация,
	//|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.КатегорияКонтрагента,	
	//|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.ВидДокумента,
	//|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.БонусПроцентом
	//|ИЗ
	//|	РегистрСведений.НастройкиНачисленияБонусовПоПродажам.СрезПоследних(&Дата, ) КАК НастройкиНачисленияБонусовПоПродажамСрезПоследних
	//|ГДЕ
	//|	НастройкиНачисленияБонусовПоПродажамСрезПоследних.Организация = &Организация
	//|	И НастройкиНачисленияБонусовПоПродажамСрезПоследних.КатегорияКонтрагента = &КатегорияКонтрагента
	//|	И НастройкиНачисленияБонусовПоПродажамСрезПоследних.ВидДокумента = &ВидДокумента
	//|	И НастройкиНачисленияБонусовПоПродажамСрезПоследних.СчетКасса = &СчетКасса";
	//Запрос.УстановитьПараметр("Дата", Дата);
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("КатегорияКонтрагента", КатегорияКонтрагента);
	//Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);	
	//Запрос.УстановитьПараметр("СчетКасса", СчетКасса);
	
	ПараметрыОтбора = Новый Структура("Организация, ВидДокумента, КатегорияКонтрагента", Организация, ВидДокумента, КатегорияКонтрагента);
	ДокументНАНБ = ПодобратьДокументНастройкиНачисленияБонусов(ДатаРасчета, ПараметрыОтбора);
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументНАНБ", ДокументНАНБ);
	Запрос.УстановитьПараметр("СчетКасса", СчетКасса);
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.БонусПроцентом КАК БонусПроцентом
	|ИЗ
	|	Документ.НастройкаАвтоматическихНачисленийБонусов.СчетаИКассы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &ДокументНАНБ
	|	И ДанныеДокумента.СчетКасса = &СчетКасса";
	
	//-- #13834
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		БонусыКВозврату = Окр(Выборка.БонусПроцентом / 100 * СуммаДокумента, 2);	
	КонецЕсли;
	
	//Возврат БонусыКВозврату;
	
	СтруктураВозврата.ДокументНАНБ = ДокументНАНБ;
	СтруктураВозврата.СуммаБонусов = БонусыКВозврату;
	Возврат СтруктураВозврата;
	
КонецФункции

// #13834
Функция ПодобратьДокументНастройкиНачисленияБонусов(ДатаРасчета, ПараметрыОтбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НастройкаАвтоматическихНачисленийБонусов КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Дата < &ДатаРасчета
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.ВидДокумента = &ВидДокумента
	|	И ДанныеДокумента.КатегорияКонтрагента = &КатегорияКонтрагента	
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаРасчета", 			ДатаРасчета);
	Запрос.УстановитьПараметр("Организация", 			ПараметрыОтбора.Организация);
	Запрос.УстановитьПараметр("ВидДокумента", 			ПараметрыОтбора.ВидДокумента);
	Запрос.УстановитьПараметр("КатегорияКонтрагента", 	ПараметрыОтбора.КатегорияКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.НастройкаАвтоматическихНачисленийБонусов.ПустаяСсылка();
	
КонецФункции

Функция СуммаБонусовКСписаниюПриИзменении(ДокОбъект, ВалютаУчета, ОстатокБонусов, ДоступноКСписанию, СуммаДокументаБезУчетаБонусов) Экспорт
	
	СтруктураВозврата = Новый Структура("ВыполненаОчистка, ВыполненоРаспределение, ВыполненПересчет", Ложь, Ложь, Ложь);
	
	Если ДокОбъект.СуммаБонусовКСписаниюПоДисконтнойКарте = 0 Тогда		
		ОчиститьСуммуБонусовПоСтрокамДокумента(ДокОбъект);
		СтруктураВозврата.ВыполненаОчистка = Истина;
		
	Иначе
		
		Отказ = Ложь;
		//Если ДокОбъект.СлужебныйВидБонуснойСистемы = ПредопределенноеЗначение("Перечисление.ВидыБонусныхСистем.Внутренняя") Тогда
			Если ДокОбъект.СуммаБонусовКСписаниюПоДисконтнойКарте > ДоступноКСписанию Тогда				
				Сообщить("Согласно настроек программы нельзя списать более " + ДоступноКСписанию + " " + ВалютаУчета + " бонусов по данному документу");
				ДокОбъект.СуммаБонусовКСписаниюПоДисконтнойКарте = 0;
				ОчиститьСуммуБонусовПоСтрокамДокумента(ДокОбъект);
				СтруктураВозврата.ВыполненаОчистка = Истина;
				Отказ = Истина;
			КонецЕсли;
		//КонецЕсли;	
		
		Если ДокОбъект.СуммаБонусовКСписаниюПоДисконтнойКарте > ОстатокБонусов Тогда				
			Сообщить("Остаток бонусов " + ОстатокБонусов + " " + ВалютаУчета + ", нельзя списать больше этой суммы");
			ДокОбъект.СуммаБонусовКСписаниюПоДисконтнойКарте = 0;
			ОчиститьСуммуБонусовПоСтрокамДокумента(ДокОбъект);
			СтруктураВозврата.ВыполненаОчистка = Истина;
			Отказ = Истина;
		КонецЕсли;		
		
		Если ДокОбъект.СуммаБонусовКСписаниюПоДисконтнойКарте > РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(ДокОбъект.Ссылка, СуммаДокументаБезУчетаБонусов) Тогда			
			Сообщить("Сумма всего документа (в валюте учета) " + РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(ДокОбъект.Ссылка, ДокОбъект.СуммаДокумента) + " " + ВалютаУчета + ", нельзя списать больше этой суммы");
			ДокОбъект.СуммаБонусовКСписаниюПоДисконтнойКарте = 0;
			ОчиститьСуммуБонусовПоСтрокамДокумента(ДокОбъект);
			СтруктураВозврата.ВыполненаОчистка = Истина;
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ Отказ Тогда			
			// распределяем скидку, пересчитываем строки и сумму документа
			РаспределитьСкидкуБонусамиПоСтрокамДокумента(ДокОбъект);			
			СтруктураВозврата.ВыполненоРаспределение = Истина;
			Возврат СтруктураВозврата;
		КонецЕсли;
		
	КонецЕсли;
	
	ПересчитатьБонусыПоДокументу(ДокОбъект);
	СтруктураВозврата.ВыполненПересчет = Истина;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ОстатокБонусов(Контрагент, Дата = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, Дата(3000,1,1), Новый Граница(Дата, ВидГраницы.Включая)));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(БонусыКонтрагентовОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.БонусыКонтрагентов.Остатки(&Дата, Контрагент = &Контрагент) КАК БонусыКонтрагентовОстатки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ОбработчикиПриОбновленииНаВерсию_2_8_34() Экспорт
	
	//#13834
	
	//1. настройка
	БонусыПоОплатам = Константы.УДАЛИТЬ_АвтоматическиНачислятьБонусыВДокументахОплаты.Получить();
	БонусыПоПродажам = Константы.УДАЛИТЬ_АвтоматическоеНачислениеБонусов.Получить();
	
	АвтоматическиНачислятьБонусы = БонусыПоОплатам ИЛИ БонусыПоПродажам;
								
	Константы.АвтоматическиНачислятьБонусы.Установить(АвтоматическиНачислятьБонусы);
	
	// 2. новый вид документа
	ЕстьНастройкиПоПродажам = Ложь;
	ЕстьНастройкиПоОБК = Ложь;
	ЕстьНастройкиПоПКО = Ложь;
	ЕстьНастройкиПоРКО = Ложь;
	ЕстьНастройкиПоПнРС = Ложь;
	ЕстьНастройкиПоОплатам = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиНачисления.Период КАК Период,
	
	|	НастройкиНачисления.Организация КАК Организация,
	|	НастройкиНачисления.ВидДокумента КАК ВидДокумента,
	|	НастройкиНачисления.КатегорияКонтрагента КАК КатегорияКонтрагента,
	
	|	НастройкиНачисления.ВидНоменклатуры КАК ВидНоменклатуры,
	|	НастройкиНачисления.Категория КАК Категория,
	|	НастройкиНачисления.Номенклатура КАК Номенклатура,
	|	НастройкиНачисления.СчетКасса КАК СчетКасса,
	|	НастройкиНачисления.БонусСуммой КАК БонусСуммой,
	|	НастройкиНачисления.БонусПроцентом КАК БонусПроцентом,
	|	НастройкиНачисления.НеНачислятьБонусы КАК НеНачислятьБонусы
	|ИЗ
	|	РегистрСведений.НастройкиНачисленияБонусовПоПродажам КАК НастройкиНачисления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ВидДокумента,
	|	КатегорияКонтрагента,
	|	Период
	|ИТОГИ ПО
	|	Организация,
	|	ВидДокумента,
	|	КатегорияКонтрагента,
	|	Период";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Попытка
		// все в одной транзакции
		НачатьТранзакцию();
		
		ВыборкаПоОрганизациям = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоОрганизациям.Следующий() Цикл
			ВыборкаПоВидамДокументов = ВыборкаПоОрганизациям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоВидамДокументов.Следующий() Цикл
				ВыборкаПоКатегориямКонтрагентов = ВыборкаПоВидамДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоКатегориямКонтрагентов.Следующий() Цикл
					ВыборкаПоПериодам = ВыборкаПоКатегориямКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Таблица1 = Неопределено;
					Таблица2 = Неопределено;
					Таблица3 = Неопределено;										
					
					Пока ВыборкаПоПериодам.Следующий() Цикл
						
						НовыйДокумент = Документы.НастройкаАвтоматическихНачисленийБонусов.СоздатьДокумент();
						НовыйДокумент.Заполнить(Неопределено);
						НовыйДокумент.Дата = ВыборкаПоПериодам.Период;
						НовыйДокумент.Организация = ВыборкаПоОрганизациям.Организация;
						НовыйДокумент.ВидДокумента = ВыборкаПоВидамДокументов.ВидДокумента;
						НовыйДокумент.КатегорияКонтрагента = ВыборкаПоКатегориямКонтрагентов.КатегорияКонтрагента;
						НовыйДокумент.Комментарий = "#Создан автоматически при обновлении на версию 2.8.Х";
						
						// ??? КАЖДЫЙ СЛЕДУЮЩИЙ ДОКУМЕНТ ПО ПЕРИОДУ ДОЛЖЕН СОДЕРЖАТЬ ТЧ ПРЕДЫДУЩЕГО ???
						Если НЕ Таблица1 = Неопределено Тогда
							НовыйДокумент.НастройкаПоВидамНоменклатуры.Загрузить(Таблица1);
						КонецЕсли;
						Если НЕ Таблица2 = Неопределено Тогда
							НовыйДокумент.НастройкаПоНоменклатуре.Загрузить(Таблица2);
						КонецЕсли;
						Если НЕ Таблица3 = Неопределено Тогда
							НовыйДокумент.СчетаИКассы.Загрузить(Таблица3);
						КонецЕсли;
						
						Выборка = ВыборкаПоПериодам.Выбрать();
						
						Пока Выборка.Следующий() Цикл
							
							Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
								ИмяТабличнойЧасти = "НастройкаПоНоменклатуре";
								ПараметрыОтбора = Новый Структура("Номенклатура");
								
							ИначеЕсли ЗначениеЗаполнено(Выборка.ВидНоменклатуры) ИЛИ ЗначениеЗаполнено(Выборка.Категория) Тогда
								ИмяТабличнойЧасти = "НастройкаПоВидамНоменклатуры";
								ПараметрыОтбора = Новый Структура("ВидНоменклатуры, Категория");
								
							ИначеЕсли ЗначениеЗаполнено(Выборка.СчетКасса) Тогда
								ИмяТабличнойЧасти = "СчетаИКассы";
								ПараметрыОтбора = Новый Структура("СчетКасса");
								
							Иначе
								Продолжить;
								
							КонецЕсли;
							
							ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
							
							НайденныеСтроки = НовыйДокумент[ИмяТабличнойЧасти].НайтиСтроки(ПараметрыОтбора);
							Если НайденныеСтроки.Количество() = 0 Тогда
								СтрокаТабличнойЧасти = НовыйДокумент[ИмяТабличнойЧасти].Добавить();
							Иначе
								СтрокаТабличнойЧасти = НайденныеСтроки[0];
							КонецЕсли;
							
							ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
							
						КонецЦикла;
						
						Таблица1 = НовыйДокумент.НастройкаПоВидамНоменклатуры.Выгрузить();
					    Таблица2 = НовыйДокумент.НастройкаПоНоменклатуре.Выгрузить();
						Таблица3 = НовыйДокумент.СчетаИКассы.Выгрузить();
						
						Если Таблица1.Количество() > 0 ИЛИ Таблица2.Количество() > 0 ИЛИ Таблица3.Количество() > 0 Тогда
							НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;
						
						Если ВыборкаПоВидамДокументов.ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.РеализацияТоваровИУслуг Тогда
							ЕстьНастройкиПоПродажам = Истина;
						ИначеЕсли ВыборкаПоВидамДокументов.ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.ОплатаБанковскойКартой Тогда
							ЕстьНастройкиПоОБК = Истина;
						ИначеЕсли ВыборкаПоВидамДокументов.ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.ПриходныйКассовыйОрдер Тогда
							ЕстьНастройкиПоПКО = Истина;
						ИначеЕсли ВыборкаПоВидамДокументов.ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.РасходныйКассовыйОрдер Тогда
							ЕстьНастройкиПоРКО = Истина;
						ИначеЕсли ВыборкаПоВидамДокументов.ВидДокумента = Справочники.ВидыДокументовНачисленияБонусов.ПоступлениеНаРасчетныйСчет Тогда
							ЕстьНастройкиПоПнРС = Истина;
						КонецЕсли;
					КонецЦикла;
					
				КонецЦикла;
				
				
			КонецЦикла;
		КонецЦикла;		
		
		// документы-стопы		
		Если НЕ БонусыПоПродажам И ЕстьНастройкиПоПродажам Тогда //И АвтоматическиНачислятьБонусы Тогда
			
			// если на данный момент отключены бонусы по реализации, но есть документы "НастройкаАвтоматическихНачисленийБонусов"
			// то найдем последний документ реализации, при котором была включена настройка и создадим стоп-начисление
			Запрос = Новый запрос;
			Запрос.УстановитьПараметр("ВидДокументаНачисленияБонусов", Справочники.ВидыДокументовНачисленияБонусов.РеализацияТоваровИУслуг);
			ТекстЗапроса = ТекстЗапросаПоискПоследнегоДокумента();
			Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%Таблица", "РеализацияТоваровИУслуг");
			
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			
			ДатаДокумента = Неопределено;
			Выборка = РезультатЗапроса[0].Выбрать();
			Если Выборка.Следующий() Тогда
				ДатаДокумента = Выборка.Дата + 1;
			КонецЕсли;
			
			Выборка = РезультатЗапроса[2].Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Дата = ?(ДатаДокумента = Неопределено, Выборка.Дата + 1, Макс(ДатаДокумента, Выборка.Дата + 1));
				РезультатСД = СоздатьСтопНастройкуАвтоматическихНачисленийБонусов(Дата, Выборка.Ссылка, Истина, Истина, Ложь);
				
				Если НЕ РезультатСД Тогда
					ВызватьИсключение "";
				КонецЕсли;				
				
			КонецЦикла;
		КонецЕсли; 		
		
		ЕстьНастройкиПоОплатам = ЕстьНастройкиПоОБК ИЛИ ЕстьНастройкиПоПКО ИЛИ ЕстьНастройкиПоРКО ИЛИ ЕстьНастройкиПоПнРС ;
	
		Если НЕ БонусыПоОплатам И ЕстьНастройкиПоОплатам Тогда //И АвтоматическиНачислятьБонусы Тогда
			
			// если на данный момент отключены бонусы по оплатам, но есть документы "НастройкаАвтоматическихНачисленийБонусов"
			// то найдем последний документ оплаты (по видам), при котором была включена настройка и создадим стоп-начисление
			МассивДок = новый Массив;
			Если ЕстьНастройкиПоОБК Тогда
				МассивДок.Добавить(Новый Структура("Таблица, ВидДокумента", "ОплатаБанковскойКартой", Справочники.ВидыДокументовНачисленияБонусов.ОплатаБанковскойКартой));
			КонецЕсли;
			Если ЕстьНастройкиПоПКО Тогда
				МассивДок.Добавить(Новый Структура("Таблица, ВидДокумента", "ПриходныйКассовыйОрдер", Справочники.ВидыДокументовНачисленияБонусов.ПриходныйКассовыйОрдер));
			КонецЕсли;
			Если ЕстьНастройкиПоПнРС Тогда
				МассивДок.Добавить(Новый Структура("Таблица, ВидДокумента", "ПоступлениеНаРасчетныйСчет", Справочники.ВидыДокументовНачисленияБонусов.ПоступлениеНаРасчетныйСчет));			
			КонецЕсли;
			Если ЕстьНастройкиПоРКО Тогда
				МассивДок.Добавить(Новый Структура("Таблица, ВидДокумента", "РасходныйКассовыйОрдер", Справочники.ВидыДокументовНачисленияБонусов.РасходныйКассовыйОрдер));
			КонецЕсли;
			
			Для каждого ЭлементМассива из МассивДок Цикл
				Запрос = Новый запрос;
				Запрос.УстановитьПараметр("ВидДокументаНачисленияБонусов", ЭлементМассива.ВидДокумента);
				ТекстЗапроса = ТекстЗапросаПоискПоследнегоДокумента();
				Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%Таблица", ЭлементМассива.Таблица);
				
				РезультатЗапроса = Запрос.ВыполнитьПакет();
				
				ДатаДокумента = Неопределено;
				Выборка = РезультатЗапроса[0].Выбрать();
				Если Выборка.Следующий() Тогда
					ДатаДокумента = Выборка.Дата + 1;
				КонецЕсли;
				
				Выборка = РезультатЗапроса[2].Выбрать();
				Пока Выборка.Следующий() Цикл
					
					Дата = ?(ДатаДокумента = Неопределено, Выборка.Дата + 1, Макс(ДатаДокумента, Выборка.Дата + 1));
					РезультатСД = СоздатьСтопНастройкуАвтоматическихНачисленийБонусов(Дата, Выборка.Ссылка, Ложь, Ложь, Истина);
					
					Если НЕ РезультатСД Тогда
						ВызватьИсключение "";
					КонецЕсли;				
					
				КонецЦикла;
			КонецЦикла;

		КонецЕсли;
	
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации("Обновление информационной базы", УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение; // обновление невозможно
	КонецПопытки;
		
КонецПроцедуры
 
Функция ТекстЗапросаПоискПоследнегоДокумента()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата
	|ИЗ
	|	Документ.%Таблица КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.НачислятьБонусы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(НастройкаАвтоматическихНачисленийБонусов.Дата) КАК Дата,
	|	НастройкаАвтоматическихНачисленийБонусов.Организация КАК Организация,
	|	НастройкаАвтоматическихНачисленийБонусов.ВидДокумента КАК ВидДокумента,
	|	НастройкаАвтоматическихНачисленийБонусов.КатегорияКонтрагента КАК КатегорияКонтрагента
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.НастройкаАвтоматическихНачисленийБонусов КАК НастройкаАвтоматическихНачисленийБонусов
	|ГДЕ
	|	НастройкаАвтоматическихНачисленийБонусов.ВидДокумента = &ВидДокументаНачисленияБонусов
	|	И НЕ НастройкаАвтоматическихНачисленийБонусов.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкаАвтоматическихНачисленийБонусов.Организация,
	|	НастройкаАвтоматическихНачисленийБонусов.ВидДокумента,
	|	НастройкаАвтоматическихНачисленийБонусов.КатегорияКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкаАвтоматическихНачисленийБонусов.Ссылка КАК Ссылка,
	|	НастройкаАвтоматическихНачисленийБонусов.Дата КАК Дата
	|ИЗ
	|	Документ.НастройкаАвтоматическихНачисленийБонусов КАК НастройкаАвтоматическихНачисленийБонусов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО НастройкаАвтоматическихНачисленийБонусов.Дата = ВТ.Дата
	|			И НастройкаАвтоматическихНачисленийБонусов.Организация = ВТ.Организация
	|			И НастройкаАвтоматическихНачисленийБонусов.ВидДокумента = ВТ.ВидДокумента
	|			И НастройкаАвтоматическихНачисленийБонусов.КатегорияКонтрагента = ВТ.КатегорияКонтрагента
	|ГДЕ
	|	НЕ НастройкаАвтоматическихНачисленийБонусов.ПометкаУдаления";
	
КонецФункции

Функция СоздатьСтопНастройкуАвтоматическихНачисленийБонусов(Дата, Основание, СтопПоВидамНоменклатуры = Ложь, СтопПоНоменклатуре = Ложь, СтопПоСчетамКассам = Ложь)
	
	НовыйДокумент = Документы.НастройкаАвтоматическихНачисленийБонусов.СоздатьДокумент();
	НовыйДокумент.Заполнить(Основание);
	НовыйДокумент.Дата = Дата;
	НовыйДокумент.Комментарий = "#Создан автоматически при обновлении на версию 2.8.Х (стоп)";
	
	Если СтопПоВидамНоменклатуры Тогда	
		Для каждого СтрокаТЧ из НовыйДокумент.НастройкаПоВидамНоменклатуры Цикл
			СтрокаТЧ.БонусСуммой = 0;
			СтрокаТЧ.БонусПроцентом = 0;
			СтрокаТЧ.НеНачислятьБонусы = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Если СтопПоНоменклатуре Тогда
		Для каждого СтрокаТЧ из НовыйДокумент.НастройкаПоНоменклатуре Цикл
			СтрокаТЧ.БонусСуммой = 0;
			СтрокаТЧ.БонусПроцентом = 0;
			СтрокаТЧ.НеНачислятьБонусы = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Если СтопПоСчетамКассам Тогда 
		Для каждого СтрокаТЧ из НовыйДокумент.СчетаИКассы Цикл
			СтрокаТЧ.БонусПроцентом = 0;
		КонецЦикла;
	КонецЕсли;
	
	Если НовыйДокумент.НастройкаПоВидамНоменклатуры.Количество() > 0 
		ИЛИ НовыйДокумент.НастройкаПоНоменклатуре.Количество() > 0 
		ИЛИ НовыйДокумент.СчетаИКассы.Количество() > 0 Тогда
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Возврат Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
			
#КонецОбласти
